GopalSaraf/Practicals/PSDL/include/proc/pic16lf18456.h
// ADCAP<CAP2>
extern volatile __bit                   CAP2                __at(0x872);	// @ (0x10E * 8 + 2)
#define                                 CAP2_bit            _BIT_ACCESS(ADCAP,2)
// ADCAP<CAP3>
extern volatile __bit                   CAP3                __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 CAP3_bit            _BIT_ACCESS(ADCAP,3)
// ADCAP<CAP4>
extern volatile __bit                   CAP4                __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 CAP4_bit            _BIT_ACCESS(ADCAP,4)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE6<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR6,0)
// PMD4<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD4,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF50B);	// @ (0x1EA1 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF50C);	// @ (0x1EA1 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1897);	// @ (0x312 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1894);	// @ (0x312 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// PMD4<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD4,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x18B8);	// @ (0x317 * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x18B9);	// @ (0x317 * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x18BA);	// @ (0x317 * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CAP<CCP3CTS3>
extern volatile __bit                   CCP3CTS3            __at(0x18BB);	// @ (0x317 * 8 + 3)
#define                                 CCP3CTS3_bit        _BIT_ACCESS(CCP3CAP,3)
// CCP3CAP<CCP3CTS4>
extern volatile __bit                   CCP3CTS4            __at(0x18BC);	// @ (0x317 * 8 + 4)
#define                                 CCP3CTS4_bit        _BIT_ACCESS(CCP3CAP,4)
// CCP3CAP<CCP3CTS5>
extern volatile __bit                   CCP3CTS5            __at(0x18BD);	// @ (0x317 * 8 + 5)
#define                                 CCP3CTS5_bit        _BIT_ACCESS(CCP3CAP,5)
// CCP3CAP<CCP3CTS6>
extern volatile __bit                   CCP3CTS6            __at(0x18BE);	// @ (0x317 * 8 + 6)
#define                                 CCP3CTS6_bit        _BIT_ACCESS(CCP3CAP,6)
// CCP3CAP<CCP3CTS7>
extern volatile __bit                   CCP3CTS7            __at(0x18BF);	// @ (0x317 * 8 + 7)
#define                                 CCP3CTS7_bit        _BIT_ACCESS(CCP3CAP,7)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x18B7);	// @ (0x316 * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x18B4);	// @ (0x316 * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE6<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x38E2);	// @ (0x71C * 8 + 2)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR6,2)
// PMD4<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD4,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x18B0);	// @ (0x316 * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x18B1);	// @ (0x316 * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x18B2);	// @ (0x316 * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x18B3);	// @ (0x316 * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OE>
extern volatile __bit                   CCP3OE              __at(0x18B6);	// @ (0x316 * 8 + 6)
#define                                 CCP3OE_bit          _BIT_ACCESS(CCP3CON,6)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x18B5);	// @ (0x316 * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP3PPS<CCP3PPS0>
extern volatile __bit                   CCP3PPS0            __at(0xF518);	// @ (0x1EA3 * 8 + 0)
#define                                 CCP3PPS0_bit        _BIT_ACCESS(CCP3PPS,0)
// CCP3PPS<CCP3PPS1>
extern volatile __bit                   CCP3PPS1            __at(0xF519);	// @ (0x1EA3 * 8 + 1)
#define                                 CCP3PPS1_bit        _BIT_ACCESS(CCP3PPS,1)
// CCP3PPS<CCP3PPS2>
extern volatile __bit                   CCP3PPS2            __at(0xF51A);	// @ (0x1EA3 * 8 + 2)
#define                                 CCP3PPS2_bit        _BIT_ACCESS(CCP3PPS,2)
// CCP3PPS<CCP3PPS3>
extern volatile __bit                   CCP3PPS3            __at(0xF51B);	// @ (0x1EA3 * 8 + 3)
#define                                 CCP3PPS3_bit        _BIT_ACCESS(CCP3PPS,3)
// CCP3PPS<CCP3PPS4>
extern volatile __bit                   CCP3PPS4            __at(0xF51C);	// @ (0x1EA3 * 8 + 4)
#define                                 CCP3PPS4_bit        _BIT_ACCESS(CCP3PPS,4)
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x18D8);	// @ (0x31B * 8 + 0)
#define                                 CCP4CTS0_bit        _BIT_ACCESS(CCP4CAP,0)
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x18D9);	// @ (0x31B * 8 + 1)
#define                                 CCP4CTS1_bit        _BIT_ACCESS(CCP4CAP,1)
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x18DA);	// @ (0x31B * 8 + 2)
#define                                 CCP4CTS2_bit        _BIT_ACCESS(CCP4CAP,2)
// CCP4CAP<CCP4CTS3>
extern volatile __bit                   CCP4CTS3            __at(0x18DB);	// @ (0x31B * 8 + 3)
#define                                 CCP4CTS3_bit        _BIT_ACCESS(CCP4CAP,3)
// CCP4CAP<CCP4CTS4>
extern volatile __bit                   CCP4CTS4            __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 CCP4CTS4_bit        _BIT_ACCESS(CCP4CAP,4)
// CCP4CAP<CCP4CTS5>
extern volatile __bit                   CCP4CTS5            __at(0x18DD);	// @ (0x31B * 8 + 5)
#define                                 CCP4CTS5_bit        _BIT_ACCESS(CCP4CAP,5)
// CCP4CAP<CCP4CTS6>
extern volatile __bit                   CCP4CTS6            __at(0x18DE);	// @ (0x31B * 8 + 6)
#define                                 CCP4CTS6_bit        _BIT_ACCESS(CCP4CAP,6)
// CCP4CAP<CCP4CTS7>
extern volatile __bit                   CCP4CTS7            __at(0x18DF);	// @ (0x31B * 8 + 7)
#define                                 CCP4CTS7_bit        _BIT_ACCESS(CCP4CAP,7)
// CCP4CON<CCP4EN>
extern volatile __bit                   CCP4EN              __at(0x18D7);	// @ (0x31A * 8 + 7)
#define                                 CCP4EN_bit          _BIT_ACCESS(CCP4CON,7)
// CCP4CON<CCP4FMT>
extern volatile __bit                   CCP4FMT             __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 CCP4FMT_bit         _BIT_ACCESS(CCP4CON,4)
// PIE6<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x38E3);	// @ (0x71C * 8 + 3)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE6,3)
// PIR6<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x3893);	// @ (0x712 * 8 + 3)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR6,3)
// PMD4<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD4,3)
// CCP4CON<CCP4MODE0>
extern volatile __bit                   CCP4MODE0           __at(0x18D0);	// @ (0x31A * 8 + 0)
#define                                 CCP4MODE0_bit       _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4MODE1>
extern volatile __bit                   CCP4MODE1           __at(0x18D1);	// @ (0x31A * 8 + 1)
#define                                 CCP4MODE1_bit       _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4MODE2>
extern volatile __bit                   CCP4MODE2           __at(0x18D2);	// @ (0x31A * 8 + 2)
#define                                 CCP4MODE2_bit       _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4MODE3>
extern volatile __bit                   CCP4MODE3           __at(0x18D3);	// @ (0x31A * 8 + 3)
#define                                 CCP4MODE3_bit       _BIT_ACCESS(CCP4CON,3)
// CCP4CON<CCP4OE>
extern volatile __bit                   CCP4OE              __at(0x18D6);	// @ (0x31A * 8 + 6)
#define                                 CCP4OE_bit          _BIT_ACCESS(CCP4CON,6)
// CCP4CON<CCP4OUT>
extern volatile __bit                   CCP4OUT             __at(0x18D5);	// @ (0x31A * 8 + 5)
#define                                 CCP4OUT_bit         _BIT_ACCESS(CCP4CON,5)
// CCP4PPS<CCP4PPS0>
extern volatile __bit                   CCP4PPS0            __at(0xF520);	// @ (0x1EA4 * 8 + 0)
#define                                 CCP4PPS0_bit        _BIT_ACCESS(CCP4PPS,0)
// CCP4PPS<CCP4PPS1>
extern volatile __bit                   CCP4PPS1            __at(0xF521);	// @ (0x1EA4 * 8 + 1)
#define                                 CCP4PPS1_bit        _BIT_ACCESS(CCP4PPS,1)
// CCP4PPS<CCP4PPS2>
extern volatile __bit                   CCP4PPS2            __at(0xF522);	// @ (0x1EA4 * 8 + 2)
#define                                 CCP4PPS2_bit        _BIT_ACCESS(CCP4PPS,2)
// CCP4PPS<CCP4PPS3>
extern volatile __bit                   CCP4PPS3            __at(0xF523);	// @ (0x1EA4 * 8 + 3)
#define                                 CCP4PPS3_bit        _BIT_ACCESS(CCP4PPS,3)
// CCP4PPS<CCP4PPS4>
extern volatile __bit                   CCP4PPS4            __at(0xF524);	// @ (0x1EA4 * 8 + 4)
#define                                 CCP4PPS4_bit        _BIT_ACCESS(CCP4PPS,4)
// CCP5CAP<CCP5CTS0>
extern volatile __bit                   CCP5CTS0            __at(0x18F8);	// @ (0x31F * 8 + 0)
#define                                 CCP5CTS0_bit        _BIT_ACCESS(CCP5CAP,0)
// CCP5CAP<CCP5CTS1>
extern volatile __bit                   CCP5CTS1            __at(0x18F9);	// @ (0x31F * 8 + 1)
#define                                 CCP5CTS1_bit        _BIT_ACCESS(CCP5CAP,1)
// CCP5CAP<CCP5CTS2>
extern volatile __bit                   CCP5CTS2            __at(0x18FA);	// @ (0x31F * 8 + 2)
#define                                 CCP5CTS2_bit        _BIT_ACCESS(CCP5CAP,2)
// CCP5CAP<CCP5CTS3>
extern volatile __bit                   CCP5CTS3            __at(0x18FB);	// @ (0x31F * 8 + 3)
#define                                 CCP5CTS3_bit        _BIT_ACCESS(CCP5CAP,3)
// CCP5CAP<CCP5CTS4>
extern volatile __bit                   CCP5CTS4            __at(0x18FC);	// @ (0x31F * 8 + 4)
#define                                 CCP5CTS4_bit        _BIT_ACCESS(CCP5CAP,4)
// CCP5CAP<CCP5CTS5>
extern volatile __bit                   CCP5CTS5            __at(0x18FD);	// @ (0x31F * 8 + 5)
#define                                 CCP5CTS5_bit        _BIT_ACCESS(CCP5CAP,5)
// CCP5CAP<CCP5CTS6>
extern volatile __bit                   CCP5CTS6            __at(0x18FE);	// @ (0x31F * 8 + 6)
#define                                 CCP5CTS6_bit        _BIT_ACCESS(CCP5CAP,6)
// CCP5CAP<CCP5CTS7>
extern volatile __bit                   CCP5CTS7            __at(0x18FF);	// @ (0x31F * 8 + 7)
#define                                 CCP5CTS7_bit        _BIT_ACCESS(CCP5CAP,7)
// CCP5CON<CCP5EN>
extern volatile __bit                   CCP5EN              __at(0x18F7);	// @ (0x31E * 8 + 7)
#define                                 CCP5EN_bit          _BIT_ACCESS(CCP5CON,7)
// CCP5CON<CCP5FMT>
extern volatile __bit                   CCP5FMT             __at(0x18F4);	// @ (0x31E * 8 + 4)
#define                                 CCP5FMT_bit         _BIT_ACCESS(CCP5CON,4)
// PIE6<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE6,4)
// PIR6<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x3894);	// @ (0x712 * 8 + 4)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR6,4)
// PMD4<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD4,4)
// CCP5CON<CCP5MODE0>
extern volatile __bit                   CCP5MODE0           __at(0x18F0);	// @ (0x31E * 8 + 0)
#define                                 CCP5MODE0_bit       _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5MODE1>
extern volatile __bit                   CCP5MODE1           __at(0x18F1);	// @ (0x31E * 8 + 1)
#define                                 CCP5MODE1_bit       _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5MODE2>
extern volatile __bit                   CCP5MODE2           __at(0x18F2);	// @ (0x31E * 8 + 2)
#define                                 CCP5MODE2_bit       _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5MODE3>
extern volatile __bit                   CCP5MODE3           __at(0x18F3);	// @ (0x31E * 8 + 3)
#define                                 CCP5MODE3_bit       _BIT_ACCESS(CCP5CON,3)
// CCP5CON<CCP5OE>
extern volatile __bit                   CCP5OE              __at(0x18F6);	// @ (0x31E * 8 + 6)
#define                                 CCP5OE_bit          _BIT_ACCESS(CCP5CON,6)
// CCP5CON<CCP5OUT>
extern volatile __bit                   CCP5OUT             __at(0x18F5);	// @ (0x31E * 8 + 5)
#define                                 CCP5OUT_bit         _BIT_ACCESS(CCP5CON,5)
// CCP5PPS<CCP5PPS0>
extern volatile __bit                   CCP5PPS0            __at(0xF528);	// @ (0x1EA5 * 8 + 0)
#define                                 CCP5PPS0_bit        _BIT_ACCESS(CCP5PPS,0)
// CCP5PPS<CCP5PPS1>
extern volatile __bit                   CCP5PPS1            __at(0xF529);	// @ (0x1EA5 * 8 + 1)
#define                                 CCP5PPS1_bit        _BIT_ACCESS(CCP5PPS,1)
// CCP5PPS<CCP5PPS2>
extern volatile __bit                   CCP5PPS2            __at(0xF52A);	// @ (0x1EA5 * 8 + 2)
#define                                 CCP5PPS2_bit        _BIT_ACCESS(CCP5PPS,2)
// CCP5PPS<CCP5PPS3>
extern volatile __bit                   CCP5PPS3            __at(0xF52B);	// @ (0x1EA5 * 8 + 3)
#define                                 CCP5PPS3_bit        _BIT_ACCESS(CCP5PPS,3)
// CCP5PPS<CCP5PPS4>
extern volatile __bit                   CCP5PPS4            __at(0xF52C);	// @ (0x1EA5 * 8 + 4)
#define                                 CCP5PPS4_bit        _BIT_ACCESS(CCP5PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x4862);	// @ (0x90C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x4863);	// @ (0x90C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x4473);	// @ (0x88E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MD1CARH<CH0>
extern volatile __bit                   CH0                 __at(0x44D8);	// @ (0x89B * 8 + 0)
#define                                 CH0_bit             _BIT_ACCESS(MD1CARH,0)
// MD1CARH<CH1>
extern volatile __bit                   CH1                 __at(0x44D9);	// @ (0x89B * 8 + 1)
#define                                 CH1_bit             _BIT_ACCESS(MD1CARH,1)
// MD1CARH<CH2>
extern volatile __bit                   CH2                 __at(0x44DA);	// @ (0x89B * 8 + 2)
#define                                 CH2_bit             _BIT_ACCESS(MD1CARH,2)
// MD1CARH<CH3>
